<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<!DOCTYPE html>
<html>
<head>
    <title>Home task by static methods and user interface</title>
</head>
<body>
    <h2>1. Создать класс «Автомобиль» с полями гос.номер, мощность автомобиля (л.с.), год проиводства автомобиля.</h2>
    <h2>2. Добавить в класс статическое поле double «налоговая ставка» (руб.) – default = 1.</h2>
    <h2>3. Реализовать методы геттеров и сеттеров.</h2>
    <h2>4. Реализовать метод расчета налога на данный автомобиль по формуле S = P * Q – Y / Q, где P – мощность данного автомобиля (поле класса), Q – налоговая ставка, Y – возраст автомобиля (сколько машине лет, вычислить через год выпуска).</h2>
    <h2>5. Реализовать статические методы сеттера и геттера для статического поля налоговой ставки.</h2>
    <h2>6. Протестировать программу: создать несколько автомобилей, посчитать для них налоги. Далее поменять ставку, посчитать еще раз для тех же автомобилей.</h2>
    <h2>7. Добавление класса пользовательского интерфейса приветствуется.</h2>
<br/>
<a style="font-size: xx-large" href="carsTaxCalc">Cars tax calculation</a>
</body>
</html>